PhwgNamTran/STM32H747I_DISCO/Drivers/STM32H747XI/Peripherals/USART/STM32H7_USART.c
#include "STM32H7_USART.h"

/*
 * Function: USART_PIN_Config
 * --------------------------
 * Configures the GPIO pins for USART communication.
 *
 * Parameters:
 *   GPIOx        - Pointer to the GPIO peripheral
 *   GPIO_AFx     - Alternate function number for USART (0-15)
 *   USART_Rx_PIN - GPIO pin number for USART RX (0-15)
 *   USART_Tx_PIN - GPIO pin number for USART TX (0-15)
 *
 * Returns:
 *   None
 */
void USART_PIN_Config(GPIO_TypeDef *GPIOx, uint8_t GPIO_AFx, uint8_t USART_Rx_PIN, uint8_t USART_Tx_PIN)
{
    // Configure the RX pin to alternate function mode
    GPIO_Mode_Set(GPIOx, USART_Rx_PIN, GPIO_Mode_Alternate_Function);
    // Select the alternate function for the RX pin
    GPIO_Select_Alternate_Function(GPIOx, USART_Rx_PIN, GPIO_AFx);

    // Configure the TX pin to alternate function mode
    GPIO_Mode_Set(GPIOx, USART_Tx_PIN, GPIO_Mode_Alternate_Function);
    // Select the alternate function for the TX pin
    GPIO_Select_Alternate_Function(GPIOx, USART_Tx_PIN, GPIO_AFx);
}

/*
 * Function: USART_Config
 * ----------------------
 * Configures the USART peripheral with the specified parameters.
 *
 * Parameters:
 *   USARTx            - Pointer to the USART peripheral to configure.
 *   SysClock          - The system clock frequency in Hz.
 *   Baudrate          - The desired baud rate for the USART communication.
 *   OverSamplingMode  - If TRUE, enables oversampling by 8; otherwise, uses oversampling by 16.
 *   DataLengthCode    - The data length (number of data bits).
 *   NumberOfStopBit   - The number of stop bits.
 *   ParityCheck       - The parity check mode (e.g., none, even, odd).
 *
 * Returns:
 *   None
 */
void USART_Config(USART_TypeDef *USARTx, uint32_t SysClock, uint32_t Baudrate, boolean OverSamplingMode,
                                    uint8_t DataLengthCode, uint8_t NumberOfStopBit, uint8_t ParityCheck)
{
    uint32_t Baudrate_DIV;

    // Clear the data length bits in the CR1 register
    CLEAR_BIT(USARTx->CR1, USART_CR1_M1);
    CLEAR_BIT(USARTx->CR1, USART_CR1_M0);
    
    // Set the data length according to the DataLengthCode
    SET_BIT(USARTx->CR1, ((DataLengthCode & 0x2) << USART_CR1_M1_Pos));
    SET_BIT(USARTx->CR1, ((DataLengthCode & 0x1) << USART_CR1_M0_Pos));

    if (OverSamplingMode)
    {
        // Enable oversampling by 8
        SET_BIT(USARTx->CR1, USART_CR1_OVER8);
        
        // Calculate the baud rate divisor for oversampling by 8
        Baudrate_DIV = (uint16_t)(2 * SysClock / Baudrate + 0.5);
        Baudrate_DIV = (Baudrate_DIV & 0xFFF0) | ((Baudrate_DIV & 0x000F) >> 1);
    }
    else
    {
        // Enable oversampling by 16
        CLEAR_BIT(USARTx->CR1, USART_CR1_OVER8);
        
        // Calculate the baud rate divisor for oversampling by 16
        Baudrate_DIV = (uint32_t)(SysClock / Baudrate + 0.5);
    }
    
    // Set the baud rate divisor in the BRR register
    WRITE_REG(USARTx->BRR, Baudrate_DIV);

    // Set the number of stop bits in the CR2 register
    SET_BIT(USARTx->CR2, (NumberOfStopBit << USART_CR2_STOP_Pos));

    if (ParityCheck == USART_Parity_None)
    {
        // Disable parity control
        CLEAR_BIT(USARTx->CR1, USART_CR1_PCE);
    }
    else
    {
        // Enable parity control
        SET_BIT(USARTx->CR1, USART_CR1_PCE);
        
        // Clear parity selection bit
        CLEAR_BIT(USARTx->CR1, USART_CR1_PS);
        
        // Set parity selection bit according to ParityCheck
        CLEAR_BIT(USARTx->CR1, (ParityCheck << USART_CR1_PS_Pos));
    }
}

/*
 * Function: USART_Enable_ClockSource
 * ----------------------------------
 * Enables the clock source for the specified USART peripheral.
 *
 * Parameters:
 *   USARTx - Pointer to the USART peripheral instance. This parameter can be one of the following values:
 * 
 * Returns:
 *   None
 */
void USART_Enable_ClockSource(USART_TypeDef *USARTx)
{
    // Enable clock source for USART1
    if (USARTx == USART1)
    {
        SET_BIT(RCC->APB2ENR, USART1_ClockSource);
    }
    // Enable clock source for USART2
    else if (USARTx == USART2)
    {
        SET_BIT(RCC->APB1LENR, USART2_ClockSource);
    }
    // Enable clock source for USART3
    else if (USARTx == USART3)
    {
        SET_BIT(RCC->APB1LENR, USART3_ClockSource);
    }
    // Enable clock source for UART4
    else if (USARTx == UART4)
    {
        SET_BIT(RCC->APB1LENR, UART4_ClockSource);
    }
    // Enable clock source for UART5
    else if (USARTx == UART5)
    {
        SET_BIT(RCC->APB1LENR, UART5_ClockSource);
    }
    // Enable clock source for USART6
    else if (USARTx == USART6)
    {
        SET_BIT(RCC->APB2ENR, USART6_ClockSource);
    }
    // Enable clock source for UART7
    else if (USARTx == UART7)
    {
        SET_BIT(RCC->APB1LENR, UART7_ClockSource);
    }
    // Enable clock source for UART8
    else if (USARTx == UART8)
    {
        SET_BIT(RCC->APB1LENR, UART8_ClockSource);
    }
    // No action for invalid USART instance
    else
    {
        // Handle invalid USART instance if needed
    }
}

/*
 * Function: USART_SetMode
 * ----------------------
 * Configures the USART peripheral with the specified mode.
 * 
 * Parameters:
 *   USARTx - Pointer to the USART peripheral (USART_TypeDef *).
 *   Mode - The desired USART mode (USART_Mode).
 *
 * Returns:
 *   None
 */
void USART_SetMode(USART_TypeDef *USARTx, USART_Mode Mode)
{
    switch (Mode) {
        case USART_ASYNC_TX_ONLY:
            SET_BIT(USARTx->CR1, USART_CR1_TE);   // Enable Transmit
            CLEAR_BIT(USARTx->CR1, USART_CR1_RE); // Disable Receive
            break;
            
        case USART_ASYNC_RX_ONLY:
            CLEAR_BIT(USARTx->CR1, USART_CR1_TE); // Disable Transmit
            SET_BIT(USARTx->CR1, USART_CR1_RE);   // Enable Receive
            break;
            
        case USART_ASYNC_TX_RX:
            SET_BIT(USARTx->CR1, USART_CR1_TE);  // Enable Transmit
            SET_BIT(USARTx->CR1, USART_CR1_RE);  // Enable Receive
            break;
            
        case USART_SYNCHRONOUS:
            SET_BIT(USARTx->CR2, USART_CR2_CLKEN); // Enable clock
            // Configure clock polarity and phase as needed
            // USARTx->CR2 |= (USART_CP0L1 | USART_CPHA_1); // Example setting
            SET_BIT(USARTx->CR1, USART_CR1_TE);  // Enable Transmit
            SET_BIT(USARTx->CR1, USART_CR1_RE);  // Enable Receive
            break;
            
        case USART_SINGLEWIRE:
            SET_BIT(USARTx->CR3, USART_CR3_HDSEL); // Enable single-wire mode
            SET_BIT(USARTx->CR1, USART_CR1_TE);  // Enable Transmit
            SET_BIT(USARTx->CR1, USART_CR1_RE);  // Enable Receive
            break;
            
        case USART_SMARTCARD:
            SET_BIT(USARTx->CR3, USART_CR3_SCEN); // Enable smartcard mode
            SET_BIT(USARTx->CR1, USART_CR1_TE);   // Enable Transmit
            // Configure additional smartcard settings if needed
            break;
            
        case USART_IRDA:
            SET_BIT(USARTx->CR3, USART_CR3_IREN); // Enable IrDA mode
            // Configure low-power mode if necessary
            // SET_BIT(USARTx->CR3, USART_CR3_IRLP);
            SET_BIT(USARTx->CR1, USART_CR1_TE);  // Enable Transmit
            SET_BIT(USARTx->CR1, USART_CR1_RE);  // Enable Receive
            break;
            
        case USART_LIN:
            SET_BIT(USARTx->CR2, USART_CR2_LINEN); // Enable LIN mode
            SET_BIT(USARTx->CR1, USART_CR1_TE);  // Enable Transmit
            SET_BIT(USARTx->CR1, USART_CR1_RE);  // Enable Receive
            break;
            
        case USART_RS485:
            SET_BIT(USARTx->CR3, USART_CR3_DEM); // Enable driver enable mode
            // Configure DE polarity and settings as needed
            SET_BIT(USARTx->CR1, USART_CR1_TE);  // Enable Transmit
            SET_BIT(USARTx->CR1, USART_CR1_RE);  // Enable Receive
            break;
            
        default:
            // Invalid mode, handle error if necessary
            break;
    }
}

