PhwgNamTran/STM32H747I_DISCO/Drivers/STM32H747XI/Peripherals/USART/STM32H7_USART.c
/*
 * Function: USART_GetMode
 * -----------------------
 * Determines the current operating mode of the specified USART peripheral by
 * checking the configuration of control registers CR1, CR2, and CR3.
 *
 * Parameters:
 *   USARTx - Pointer to the USART_TypeDef structure representing the USART peripheral
 *            to check. This should be one of the available USART peripherals.
 *
 * Returns:
 *   USART_Mode - An enumeration value indicating the current mode of the USART.
 */
USART_Mode USART_GetMode(USART_TypeDef *USARTx)
{
    USART_Mode l_USART_Mode;

    // Check for Synchronous mode
    if (READ_BIT(USARTx->CR2, USART_CR2_CLKEN)) 
    {
        l_USART_Mode = USART_SYNCHRONOUS;
    }
    // Check for Single-wire half-duplex mode
    else if (READ_BIT(USARTx->CR3, USART_CR3_HDSEL)) 
    {
        l_USART_Mode = USART_SINGLEWIRE;
    }
    // Check for Smartcard mode
    else if (READ_BIT(USARTx->CR3, USART_CR3_SCEN)) 
    {
        l_USART_Mode = USART_SMARTCARD;
    }
    // Check for IrDA mode
    else if (READ_BIT(USARTx->CR3, USART_CR3_IREN)) 
    {
        l_USART_Mode = USART_IRDA;
    }
    // Check for LIN mode
    else if (READ_BIT(USARTx->CR2, USART_CR2_LINEN)) 
    {
        l_USART_Mode = USART_LIN;
    }
    // Check for RS485 mode
    else if (READ_BIT(USARTx->CR3, USART_CR3_DEM)) 
    {
        l_USART_Mode = USART_RS485;
    }
    // Default to asynchronous mode if none of the above modes are set
    else 
    {
        // Check Transmit only
        if (READ_BIT(USARTx->CR1, USART_CR1_TE) && (!READ_BIT(USARTx->CR1, USART_CR1_RE))) 
        {
            l_USART_Mode = USART_ASYNC_TX_ONLY;
        }
        // Check Receive only
        else if ((!READ_BIT(USARTx->CR1, USART_CR1_TE)) && READ_BIT(USARTx->CR1, USART_CR1_RE))
        {
            l_USART_Mode = USART_ASYNC_RX_ONLY;
        }
        // Check Transmit and Receive
        else if (READ_BIT(USARTx->CR1, USART_CR1_TE) && READ_BIT(USARTx->CR1, USART_CR1_RE)) 
        {
            l_USART_Mode = USART_ASYNC_TX_RX;
        }
        else
        {
            l_USART_Mode = USART_ASYNC_TX_RX;
        }
    }

    return l_USART_Mode;
}

/*
 * Function: USART_EnableFIFO
 * --------------------------
 * Enables FIFO mode for the USART peripheral based on its current mode.
 *
 * Parameters:
 *   USARTx - Pointer to the USART_TypeDef structure representing the USART peripheral
 *            to configure.
 * Returns:
 *   None
 *
 * Note:
 *   FIFO mode can be used in standard UART communication, SPI master/slave mode,
 *   and Smartcard modes only. It must not be enabled in IrDA and LIN modes.
 */
void USART_EnableFIFO(USART_TypeDef *USARTx)
{
    // Read the current mode configuration
    USART_Mode l_USART_Mode = USART_GetMode(USARTx);

    switch (l_USART_Mode) 
    {
        case USART_ASYNC_TX_ONLY:
        case USART_ASYNC_RX_ONLY:
        case USART_ASYNC_TX_RX:
        case USART_SYNCHRONOUS:
        case USART_SMARTCARD:
            SET_BIT(USARTx->CR1,USART_CR1_FIFOEN);
            break;
        case USART_IRDA:
        case USART_LIN:
        case USART_SINGLEWIRE:
        case USART_RS485:
            /* Nothing to do: FIFO is not supported in these Mode */
            break;
        default:
            /* Nothing to do, handle invalid case if needed */
            break;
    }
}

/*
 * Function: USART_DisableFIFO
 * ---------------------------
 * Disables FIFO mode for the USART peripheral based on its current mode.
 *
 * Parameters:
 *   USARTx - Pointer to the USART_TypeDef structure representing the USART peripheral
 *            to configure.
 * Returns:
 *   None
 *
 * Note:
 *   This function disables FIFO mode regardless of the current USART mode.
 */
void USART_DisableFIFO(USART_TypeDef *USARTx)
{
    // Read the current mode configuration
    USART_Mode l_USART_Mode = USART_GetMode(USARTx);

    switch (l_USART_Mode) 
    {
        case USART_ASYNC_TX_ONLY:
        case USART_ASYNC_RX_ONLY:
        case USART_ASYNC_TX_RX:
        case USART_SYNCHRONOUS:
        case USART_SMARTCARD:
            CLEAR_BIT(USARTx->CR1, USART_CR1_FIFOEN);
            break;
        case USART_IRDA:
        case USART_LIN:
        case USART_SINGLEWIRE:
        case USART_RS485:
            /* Nothing to do: FIFO is not supported in these Mode */
            break;
        default:
            /* Nothing to do, handle invalid case if needed */
            break;
    }
}

/*
 * Function: USART_IsFIFOEnabled
 * -----------------------------
 * Checks if FIFO mode is enabled for the specified USART peripheral.
 *
 * Parameters:
 *   USARTx - Pointer to the USART_TypeDef structure representing the USART peripheral
 *            to check.
 *
 * Returns:
 *   true if FIFO mode is enabled, false otherwise.
 */
boolean USART_IsFIFOEnabled(USART_TypeDef *USARTx)
{
    // Check if the FIFO enable bit is set in the CR1 register
    return (CHECK_BIT(USARTx->CR1, USART_CR1_FIFOEN));
}

/*
 * Function: USART_ConfigInterrupt
 * -------------------------------
 * Configures the USART interrupts based on the specified mode.
 * Enables interrupts according to the provided configuration.
 * 
 * Parameters:
 *   USARTx - Pointer to the USART peripheral (e.g., USART1, USART2, etc.)
 *   Interrupt_Mode - Specifies the interrupt mode(s) to configure
 * 
 * Returns:
 *   None
 */
void USART_Enable_Interrupt(USART_TypeDef *USARTx, uint32_t Interrupt_Mode)
{
    if(USART_IsFIFOEnabled(USARTx) == true)
    {
        if (Interrupt_Mode & USART_Interrupt_TransmitFIFONotFull) 
        {
            SET_BIT(USARTx->CR1, USART_CR1_TXEIE);
        }
        if (Interrupt_Mode & USART_Interrupt_TransmitFIFOEmpty) 
        {
            SET_BIT(USARTx->CR1, USART_CR1_TXFEIE);
        }
        if (Interrupt_Mode & USART_Interrupt_TransmitFIFOThresholdReached)
        {
            SET_BIT(USARTx->CR3, USART_CR3_TXFTIE);
        }  
        if (Interrupt_Mode & USART_Interrupt_ReceiveFIFONotEmpty) 
        {
            SET_BIT(USARTx->CR1, USART_CR1_RXNEIE);
        }
        if (Interrupt_Mode & USART_Interrupt_ReceiveFIFOFull) 
        {
            SET_BIT(USARTx->CR1, USART_CR1_RXFFIE);
        }
        if (Interrupt_Mode & USART_Interrupt_ReceiveFIFOThresholdReached) 
        {
            SET_BIT(USARTx->CR3, USART_CR3_RXFTIE);
        }
    }
    // Configure USART interrupts based on the Interrupt_Mode bitmask
    if (Interrupt_Mode & USART_Interrupt_TransmitDataRegisterEmpty) 
    {
        SET_BIT(USARTx->CR1, USART_CR1_TXEIE);
    }
    if (Interrupt_Mode & USART_Interrupt_CTS) 
    {
        SET_BIT(USARTx->CR3, USART_CR3_CTSIE);
    }
    if (Interrupt_Mode & USART_Interrupt_TransmissionComplete) 
    {
        SET_BIT(USARTx->CR1, USART_CR1_TCIE);
    }
    if (Interrupt_Mode & USART_Interrupt_TransmissionCompleteBeforeGuardTime) 
    {
        SET_BIT(USARTx->CR3, USART_CR3_TCBGTIE);
    }
    if (Interrupt_Mode & USART_Interrupt_ReceptionDataNotEmpty) 
    {
        SET_BIT(USARTx->CR1, USART_CR1_RXNEIE);
    }
    if (Interrupt_Mode & USART_Interrupt_OverrunErrorDetected) 
    {
        SET_BIT(USARTx->CR1, USART_CR1_RXNEIE);
    }
    if (Interrupt_Mode & USART_Interrupt_OverrunErrorMultibuffer) 
    {
        SET_BIT(USARTx->CR3, USART_CR3_EIE);
    }
    if (Interrupt_Mode & USART_Interrupt_Idle) 
    {
        SET_BIT(USARTx->CR1, USART_CR1_IDLEIE);
    }
    if (Interrupt_Mode & USART_Interrupt_ParityError) 
    {
        SET_BIT(USARTx->CR1, USART_CR1_PEIE);
    }
    if (Interrupt_Mode & USART_Interrupt_LINBreakDetection) 
    {
        SET_BIT(USARTx->CR2, USART_CR2_LBDIE);
    }
    if (Interrupt_Mode & USART_Interrupt_NoiseError) 
    {
        SET_BIT(USARTx->CR3, USART_CR3_EIE);
    }
    if (Interrupt_Mode & USART_Interrupt_FramingError) 
    {
        SET_BIT(USARTx->CR3, USART_CR3_EIE);
    }
    if (Interrupt_Mode & USART_Interrupt_CharacterMatch) 
    {
        SET_BIT(USARTx->CR1, USART_CR1_CMIE);
    }
    if (Interrupt_Mode & USART_Interrupt_ReceiverTimeout) 
    {
        SET_BIT(USARTx->CR1, USART_CR1_RTOIE);
    }
    if (Interrupt_Mode & USART_Interrupt_EndOfBlock) 
    {
        SET_BIT(USARTx->CR1, USART_CR1_EOBIE);
    }
    if (Interrupt_Mode & USART_Interrupt_WakeupFromLowPowerMode) 
    {
        SET_BIT(USARTx->CR3, USART_CR3_WUFIE);
    }
    if (Interrupt_Mode & USART_Interrupt_SPI_SlaveUnderrun) 
    {
        SET_BIT(USARTx->CR3, USART_CR3_EIE);
    }
}

