PhwgNamTran/STM32H747I_DISCO/Drivers/STM32H747XI/Peripherals/USART/STM32H7_USART.c
/*
 * Function: USART_Check_Interrupt_Flag
 * ------------------------------------
 * Checks if a specific interrupt flag is set for the USART peripheral.
 *
 * Parameters:
 *   USARTx - Pointer to the USART_TypeDef structure representing the USART peripheral.
 *   Interrupt_Mode - The specific interrupt mode to check.
 *
 * Returns:
 *   TRUE if the interrupt flag is set, FALSE otherwise.
 */
boolean USART_Check_Interrupt_Flag(USART_TypeDef *USARTx, USART_Interrupt_Mode Interrupt_Mode)
{
    boolean flag_set = false;

    switch (Interrupt_Mode) 
    {
        case USART_Interrupt_TransmitDataRegisterEmpty:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_TXE_TXFNF);
            break;
        case USART_Interrupt_TransmitFIFONotFull:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_TXE_TXFNF);
            break;
        case USART_Interrupt_TransmitFIFOEmpty:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_TXFE);
            break;
        case USART_Interrupt_TransmitFIFOThresholdReached:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_TXFT);
            break;
        case USART_Interrupt_CTS:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_CTSIF);
            break;
        case USART_Interrupt_TransmissionComplete:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_TC);
            break;
        case USART_Interrupt_TransmissionCompleteBeforeGuardTime:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_TCBGT);
            break;
        case USART_Interrupt_ReceptionDataNotEmpty:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_RXNE_RXFNE);
            break;
        case USART_Interrupt_ReceiveFIFONotEmpty:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_RXNE_RXFNE);
            break;
        case USART_Interrupt_ReceiveFIFOFull:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_RXFF);
            break;
        case USART_Interrupt_ReceiveFIFOThresholdReached:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_RXFT);
            break;
        case USART_Interrupt_OverrunErrorDetected:
        case USART_Interrupt_OverrunErrorMultibuffer:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_ORE);
            break;
        case USART_Interrupt_Idle:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_IDLE);
            break;
        case USART_Interrupt_ParityError:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_PE);
            break;
        case USART_Interrupt_LINBreakDetection:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_LBDF);
            break;
        case USART_Interrupt_NoiseError:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_NE);
            break;
        case USART_Interrupt_FramingError:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_FE);
            break;
        case USART_Interrupt_CharacterMatch:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_CMF);
            break;
        case USART_Interrupt_ReceiverTimeout:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_RTOF);
            break;
        case USART_Interrupt_EndOfBlock:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_EOBF);
            break;
        case USART_Interrupt_WakeupFromLowPowerMode:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_WUF);
            break;
        case USART_Interrupt_SPI_SlaveUnderrun:
            flag_set = CHECK_BIT(USARTx->ISR, USART_ISR_UDR);
            break;
        default:
            flag_set = false;
            break;
    }

    return flag_set;
}

/*
 * Function: USART_Clear_Interrupt_Flag
 * ------------------------------------
 * Clears a specific interrupt flag for the USART peripheral.
 *
 * Parameters:
 *   USARTx - Pointer to the USART_TypeDef structure representing the USART peripheral.
 *   Interrupt_Mode - The specific interrupt mode to clear.
 *
 * Returns:
 *   None
 */
void USART_Clear_Interrupt_Flag(USART_TypeDef *USARTx, USART_Interrupt_Mode Interrupt_Mode)
{
    switch (Interrupt_Mode) 
    {
        case USART_Interrupt_CTS:
            // Clear CTS interrupt flag by writing 1 to CTS clear flag in ICR
            SET_BIT(USARTx->ICR, USART_ICR_CTSCF);
            break;
        case USART_Interrupt_TransmissionComplete:
            // Clear TC flag by writing 1 to TC clear flag in ICR
            SET_BIT(USARTx->ICR, USART_ICR_TCCF);
            break;
        case USART_Interrupt_TransmissionCompleteBeforeGuardTime:
            // Clear TCBGT flag by writing 1 to TCBGT clear flag in ICR
            SET_BIT(USARTx->ICR, USART_ICR_TCBGTCF);
            break;
        case USART_Interrupt_OverrunErrorDetected:
        case USART_Interrupt_OverrunErrorMultibuffer:
            // Clear ORE flag by writing 1 to ORE clear flag in ICR
            SET_BIT(USARTx->ICR, USART_ICR_ORECF);
            break;
        case USART_Interrupt_Idle:
            // Clear IDLE flag by writing 1 to IDLE clear flag in ICR
            SET_BIT(USARTx->ICR, USART_ICR_IDLECF);
            break;
        case USART_Interrupt_ParityError:
            // Clear PE flag by writing 1 to PE clear flag in ICR
            SET_BIT(USARTx->ICR, USART_ICR_PECF);
            break;
        case USART_Interrupt_LINBreakDetection:
            // Clear LBDF flag by writing 1 to LBDF clear flag in ICR
            SET_BIT(USARTx->ICR, USART_ICR_LBDCF);
            break;
        case USART_Interrupt_NoiseError:
            // Clear NE flag by writing 1 to NE clear flag in ICR
            SET_BIT(USARTx->ICR, USART_ICR_NECF);
            break;
        case USART_Interrupt_FramingError:
            // Clear FE flag by writing 1 to FE clear flag in ICR
            SET_BIT(USARTx->ICR, USART_ICR_FECF);
            break;
        case USART_Interrupt_CharacterMatch:
            // Clear CMF flag by writing 1 to CMF clear flag in ICR
            SET_BIT(USARTx->ICR, USART_ICR_CMCF);
            break;
        case USART_Interrupt_ReceiverTimeout:
            // Clear RTOF flag by writing 1 to RTOF clear flag in ICR
            SET_BIT(USARTx->ICR, USART_ICR_RTOCF);
            break;
        case USART_Interrupt_EndOfBlock:
            // Clear EOBF flag by writing 1 to EOBF clear flag in ICR
            SET_BIT(USARTx->ICR, USART_ICR_EOBCF);
            break;
        case USART_Interrupt_WakeupFromLowPowerMode:
            // Clear WUF flag by writing 1 to WUF clear flag in ICR
            SET_BIT(USARTx->ICR, USART_ICR_WUCF);
            break;
        case USART_Interrupt_SPI_SlaveUnderrun:
            // Clear UDR flag by writing 1 to UDR clear flag in ICR
            SET_BIT(USARTx->ICR, USART_ICR_UDRCF);
            break;
        case USART_Interrupt_ReceptionDataNotEmpty:

        case USART_Interrupt_ReceiveFIFONotEmpty:
        case USART_Interrupt_ReceiveFIFOFull:
        case USART_Interrupt_ReceiveFIFOThresholdReached:
        case USART_Interrupt_TransmitDataRegisterEmpty:
        case USART_Interrupt_TransmitFIFONotFull:
        case USART_Interrupt_TransmitFIFOEmpty:
        case USART_Interrupt_TransmitFIFOThresholdReached:
            break;
        default:
            // Handle other cases or invalid interrupts
            break;
    }
}

