PhwgNamTran/STM32H747I_DISCO/Drivers/STM32H747XI/Peripherals/USART/STM32H7_USART.c
/*
 * Function: USART_Enable
 * ----------------------
 * Enables the USART peripheral.
 * 
 * Parameters:
 *   USARTx - Pointer to the USART peripheral (USART_TypeDef *).
 *
 * Returns:
 *   None
 */
void USART_Enable(USART_TypeDef *USARTx)
{
    // Enable the USART peripheral by setting the UE bit
    SET_BIT(USARTx->CR1, USART_CR1_UE);
}

/*
 * Function: USART_Disable
 * -----------------------
 * Disables the specified USART peripheral by clearing the UE bit in the CR1 register.
 *
 * Parameters:
 *   USARTx - Pointer to the USART peripheral instance. This parameter can be one of the following values:
 * 
 * Returns:
 *   None
 */
void USART_Disable(USART_TypeDef *USARTx)
{
    // Disable the USART peripheral by clearing the UE bit
    CLEAR_BIT(USARTx->CR1, USART_CR1_UE);
}


/**
 * Function: USART_Transmit_Single_Data
 * ------------------------
 * Transmits a single data frame (8 or 9 bits) via the specified USART.
 *
 * Parameters:
 *   USARTx - Pointer to the USART instance to use for transmission.
 *   data - The data frame to transmit (8 or 9 bits).
 *
 * Returns:
 *   None
 */
void USART_Transmit_Single_Data(USART_TypeDef *USARTx, uint16_t Data)
{
    // Wait until TXFNF flag is set, indicating transmit data register is not full
    while (!(CHECK_BIT(USARTx->ISR, USART_ISR_TXE_TXFNF)));

    // Write the data to the USART transmit data register
    USARTx->TDR = (Data & 0x1FF);

    // Wait until TC flag is set, indicating transmission complete
    while (!(CHECK_BIT(USARTx->ISR, USART_ISR_TC)));
}


/**
 * Function: USART_Transmit
 * -------------------------------
 * Transmits a null-terminated string via the specified USART.
 *
 * Parameters:
 *   USARTx - Pointer to the USART instance to use for transmission.
 *   str - Pointer to the null-terminated string to be transmitted.
 *
 * Returns:
 *   None
 */
void USART_Transmit(USART_TypeDef *USARTx, const char *str) {
    while (*str) 
    {
        USART_Transmit_Single_Data(USARTx, *str++);
    }
}

/**
 * Function: USART_Receive_Single_Data
 * -----------------------
 * Receives a single data frame (8 or 9 bits) from the specified USART.
 *
 * Parameters:
 *   USARTx - Pointer to the USART instance to use for reception.
 *
 * Returns:
 *   The received data frame (8 or 9 bits).
 */
uint16_t USART_Receive_Single_Data(USART_TypeDef *USARTx)
{
    // Read the data from the USART receive data register
    return (uint16_t)(USARTx->RDR & 0x1FF);
}

/*
 * Function: USART_FlushReceiveData
 * --------------------------------
 * Flushes the receive data buffer of the specified USART.
 * 
 * Parameters:
 *   USARTx: Pointer to the USART register structure.
 *
 * Returns:
 *   None
 */
void USART_FlushReceiveData(USART_TypeDef *USARTx) 
{
    SET_BIT(USARTx->RQR, USART_RQR_RXFRQ);  // Set the RXFRQ bit to flush receive data
}

/*
 * Function: USART_FlushTransmitData
 * ---------------------------------
 * Flushes the transmit data buffer of the specified USART.
 * 
 * Parameters:
 *   USARTx: Pointer to the USART register structure.
 *
 * Returns:
 *   None
 */
void USART_FlushTransmitData(USART_TypeDef *USARTx) 
{
    SET_BIT(USARTx->RQR, USART_RQR_TXFRQ);  // Set the TXFRQ bit to flush transmit data
}

/*
 * Function: USART_SendBreakRequest
 * --------------------------------
 * Sends a break request on the specified USART.
 * 
 * Parameters:
 *   USARTx: Pointer to the USART register structure.
 *
 * Returns:
 *   None
 */
void USART_SendBreakRequest(USART_TypeDef *USARTx) 
{
    SET_BIT(USARTx->RQR, USART_RQR_SBKRQ);  // Set the SBKRQ bit to send break request
}

/*
 * Function: USART_EnterMuteMode
 * -----------------------------
 * Enters mute mode on the specified USART.
 * 
 * Parameters:
 *   USARTx: Pointer to the USART register structure.
 *
 * Returns:
 *   None
 */
void USART_EnterMuteMode(USART_TypeDef *USARTx) 
{
    SET_BIT(USARTx->RQR, USART_RQR_MMRQ);  // Set the MMRQ bit to enter mute mode
}

/*
 * Function: USART_AutoBaudRateRequest
 * -----------------------------------
 * Requests auto-baud rate detection on the specified USART.
 * 
 * Parameters:
 *   USARTx: Pointer to the USART register structure.
 *
 * Returns:
 *   None
 */
void USART_AutoBaudRateRequest(USART_TypeDef *USARTx) 
{
    SET_BIT(USARTx->RQR, USART_RQR_ABRRQ);  // Set the ABRRQ bit to request auto-baud rate detection
}
